src/InformationRegisters/бпсСтатусыОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<InformationRegister>
		<Properties>
			<Name>бпсСтатусыОбъектов</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бпсСтатусыОбъектов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:BusinessProcessRef.бпсСогласование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ОбъектБД</Name>
					<Type>
						<v8:Type>cfg:BusinessProcessRef.бпсСогласование</v8:Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПредметСогласования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бпсПредметыСогласований</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/бпсСтатусыОбъектов/Ext/ManagerModule.bsl
Функция ПолучитьОписаниеТЗОбъектыБД() Экспорт 
	ТЗОбъектыБД = Неопределено;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	бпсСтатусыОбъектов.ОбъектБД,
	|	бпсСтатусыОбъектов.ПредметСогласования,
	|	бпсСтатусыОбъектов.Статус
	|ИЗ
	|	РегистрСведений.бпсСтатусыОбъектов КАК бпсСтатусыОбъектов";
	
	ТЗРезультат = Запрос.Выполнить().Выгрузить();
	ТЗОбъектыБД = ТЗРезультат.СкопироватьКолонки();
	
	Возврат ТЗОбъектыБД;
КонецФункции //ПолучитьОписаниеТЗОбъектыБД()
